# Nice name! Where does it come from?

In this notebook, we will guide you through the data and code that allowed us to write our data story.

In [ ]:
# Allows to modify the code and see the changes in the notebook without restarting the kernel
%load_ext autoreload
%autoreload 2

# CMU characters and movies datasets

For this project we decided to work on the CMU movie dataset containing metadata extracted from Freebase, including Movie metadata like Movie box office revenue, genre, release date, runtime, and language but also Character metada like character names and aligned information about the actors who portray them, including gender and estimated age at the time of the movie's release. 
First let's see what the 2 metadasets contains.

#### Characters
The dataset contains informations  450,669 characters aligned to the movies such as Wikipedia movie ID,  Freebase movie ID, Movie release date, Character name, Actor date of birth, Actor gender, Actor height (in meters), Actor ethnicity,Actor name, Actor age at movie release, Freebase character/actor map ID, Freebase character ID, Freebase actor ID. 


#### Movies
The dataset contains informations on 81,741 movies such as the Wikipedia movie ID, Freebase movie ID, Movie name, Movie release date, Movie box office revenue, Movie runtime, Movie languages, Movie countries, Movie genres .



## Cleaning

The cleaning task was implement in the *clean_raw_data()* method of our different CharacterData and MovieData classes implementation and is validated using the *check_clean_data()* method, available on both classes.

From both metadataset, we directly oberved similar features such as Wikipedia Movie ID and Freebase Movie ID that is useful for futur merge of the 2 dataset. However, as in both datasets we saw that there were several columns containing Freebase and Wikipedia IDs for actors, characters and films, we decided to put them aside as the data is too difficult to access. (Freebase was discontinued a few years ago)

This are the different steps we applied to both datasets before merging:

**Character dataset**:
- Load with the right spacer.
- Rename the columns for proper understanding.
- Check the good type format : Actor date of birth and the Release Date as a datetime, and the other into objects.
- Deal with missing values : we wrote them as NaN or NaT
- Droping unwanted columns
- Checking that the cleaning was made

**Movie dataset**:
- Load with the right spacer.
- Rename the columns for proper understanding.
- Modify the Language, Country and Genre columns:  the information was a JSON format not readable nor accessible so we isolate the information and replace it by a human-readable string format.
- Modify the datatypes of movie runtime into timedelta and the release date into a datetime object for further manipulation.
- Modify the movie Name, Language, Country and Genre:  we checked that they were in object type and modified them if not.
- Deal with missing values : we wrote them as NaN or NaT
- Dropping the unwanted columns
- Check that the cleaning was made


We kept the whole dataset with NaN and NaT values in a specific file to keep features that could be interesting even if the rate of missing values is very high (such as etchnicity or Box office revenue). However, for the following notebook, to make some we decided to remove this 2 columns since they have more than 70% missing values.


## Demo

Here, we will import and clean the data base to demonstrate the process.

### MCU characters

In [2]:
import src.data.movies_char_data as mcd

# Characters data
characters = mcd.CharacterData("MCU Characters", "character.metadata.tsv", output_name = "character_data_clean.csv")
# The raw (uncleaned) data can be accessed with the attribute 'raw_df'
characters.raw_df.head()

MCU Characters : loaded 450668 rows !

,975900,/m/03vyhn,2001-08-24,Akooshay,1958-08-26,F,1.62,Unnamed: 7,Wanda De Jesus,42,/m/0bgchxw,/m/0bgcj3x,/m/03wcfv7
0,975900,/m/03vyhn,2001-08-24,Lieutenant Melanie Ballard,1974-08-15,F,1.780,/m/044038p,Natasha Henstridge,27.0,/m/0jys3m,/m/0bgchn4,/m/0346l4
1,975900,/m/03vyhn,2001-08-24,Desolation Williams,1969-06-15,M,1.727,/m/0x67,Ice Cube,32.0,/m/0jys3g,/m/0bgchn_,/m/01vw26l
2,975900,/m/03vyhn,2001-08-24,Sgt Jericho Butler,1967-09-12,M,1.750,NaN,Jason Statham,33.0,/m/02vchl6,/m/0bgchnq,/m/034hyc
3,975900,/m/03vyhn,2001-08-24,Bashira Kincaid,1977-09-25,F,1.650,NaN,Clea DuVall,23.0,/m/02vbb3r,/m/0bgchp9,/m/01y9xg
4,975900,/m/03vyhn,2001-08-24,Commander Helena Braddock,1949-05-26,F,1.727,/m/0x67,Pam Grier,52.0,/m/02vdcfp,/m/0bgchnd,/m/0418ft

In [5]:
# We can clean the data using the method 'clean_raw_data'
characters.clean_raw_data()
# The cleaned data can be accessed by calling the instance of the class
characters().head(5)

MCU Characters : Cleaning the raw data

,Wikipedia_movie_ID,Release_date,Character_name,Actor_DOB,Actor_gender,Actor_height,Actor_name,Actor_age
0,975900,2001-08-24,LIEUTENANT MELANIE BALLARD,1974-08-15,F,1.780,NATASHA HENSTRIDGE,27.0
1,975900,2001-08-24,DESOLATION WILLIAMS,1969-06-15,M,1.727,ICE CUBE,32.0
2,975900,2001-08-24,SGT JERICHO BUTLER,1967-09-12,M,1.750,JASON STATHAM,33.0
3,975900,2001-08-24,BASHIRA KINCAID,1977-09-25,F,1.650,CLEA DUVALL,23.0
4,975900,2001-08-24,COMMANDER HELENA BRADDOCK,1949-05-26,F,1.727,PAM GRIER,52.0

### MCU Movies

In [6]:
movies = mcd.MovieData("MCU Movies", "movie.metadata.tsv", output_name = "movie_data_clean.csv")

# Same methods are accessible, since they are inherited from the same parent class (DataClass)
movies.raw_df.head()

MCU Movies : loaded 81740 rows !

,975900,/m/03vyhn,Ghosts of Mars,2001-08-24,14010832,98.0,"{""/m/02h40lc"": ""English Language""}","{""/m/09c7w0"": ""United States of America""}","{""/m/01jfsb"": ""Thriller"", ""/m/06n90"": ""Science Fiction"", ""/m/03npn"": ""Horror"", ""/m/03k9fj"": ""Adventure"", ""/m/0fdjb"": ""Supernatural"", ""/m/02kdv5l"": ""Action"", ""/m/09zvmj"": ""Space western""}"
0,3196793,/m/08yl5d,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,95.0,"{""/m/02h40lc"": ""English Language""}","{""/m/09c7w0"": ""United States of America""}","{""/m/02n4kr"": ""Mystery"", ""/m/03bxz7"": ""Biograp..."
1,28463795,/m/0crgdbh,Brun bitter,1988,NaN,83.0,"{""/m/05f_3"": ""Norwegian Language""}","{""/m/05b4w"": ""Norway""}","{""/m/0lsxr"": ""Crime Fiction"", ""/m/07s9rl0"": ""D..."
2,9363483,/m/0285_cd,White Of The Eye,1987,NaN,110.0,"{""/m/02h40lc"": ""English Language""}","{""/m/07ssc"": ""United Kingdom""}","{""/m/01jfsb"": ""Thriller"", ""/m/0glj9q"": ""Erotic..."
3,261236,/m/01mrr1,A Woman in Flames,1983,NaN,106.0,"{""/m/04306rv"": ""German Language""}","{""/m/0345h"": ""Germany""}","{""/m/07s9rl0"": ""Drama""}"
4,13696889,/m/03cfc81,The Gangsters,1913-05-29,NaN,35.0,"{""/m/06ppq"": ""Silent film"", ""/m/02h40lc"": ""Eng...","{""/m/09c7w0"": ""United States of America""}","{""/m/02hmvc"": ""Short Film"", ""/m/06ppq"": ""Silen..."

In [8]:
# We can clean the data using the method 'clean_raw_data'
movies.clean_raw_data()
movies().head(5)

,Wikipedia_movie_ID,Movie_name,Release_date,Revenue,Runtime,Languages,Countries,Genres
0,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 01:35:00,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama"
1,28463795,Brun bitter,NaT,NaN,0 days 01:23:00,Norwegian,Norway,"Crime Fiction, Drama"
2,9363483,White Of The Eye,NaT,NaN,0 days 01:50:00,English,United Kingdom,"Thriller, Erotic thriller, Psychological thriller"
3,261236,A Woman in Flames,NaT,NaN,0 days 01:46:00,German,Germany,Drama
4,13696889,The Gangsters,1913-05-29,NaN,0 days 00:35:00,"Silent film, English",United States of America,"Short Film, Silent film, Indie, Black-and-whit..."

### Combine the CMU datasets
We also made a function to combine those two data sets, which allows us to have the information about characters and directly the information about the movie they are in

In [9]:
import src.utils.movies_utils as mu

merged_cmu = mu.merge_movies_characters_data(movies, characters)
merged_cmu.head(5)

Duplicates found: 412 duplicates ! removing them...

,Wikipedia_movie_ID,Movie_name,Release_date,Revenue,Runtime,Languages,Countries,Genres,Character_name,Actor_DOB,Actor_gender,Actor_height,Actor_name,Actor_age
0,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 01:35:00,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama",POLICE OFFICER,NaT,M,NaN,ALLEN CUTLER,NaN
1,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 01:35:00,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama",REPORTER,1956-12-19,F,NaN,ALICE BARRETT,43.0
2,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 01:35:00,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama",FBI PROFILER ROBERT HANKS,1950-01-05,M,NaN,ROBERT CATRINI,50.0
3,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 01:35:00,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama",JOHN RAMSEY,1945-02-12,M,1.85,CLIFF DEYOUNG,55.0
4,3196793,Getting Away with Murder: The JonBenét Ramsey ...,2000-02-16,NaN,0 days 01:35:00,English,United States of America,"Mystery, Biographical film, Drama, Crime Drama",PATSY RAMSEY,1964-07-12,F,1.63,JUDI EVANS,35.0

## Augmenting the data using IMDB
As you might have seen, some of the columns contain inexisting values (NaN, NaT, ...). For example, for the revenue of a movie and the release date, here are the proportion of missing values:

In [11]:
# Proportion of missing values in the "Revenue" column
missing_revenue = merged_cmu["Revenue"].isnull().sum() / len(merged_cmu) * 100
print(f"Proportion of missing values in the 'Revenue' column: {missing_revenue:.2f}%")

Proportion of missing values in the 'Revenue' column: 66.09%

In [13]:
# Proportion of missing Release Date
missing_release_date = merged_cmu["Release_date"].isnull().sum() / len(merged_cmu) * 100
print(f"Proportion of missing values in the 'Release_date' column: {missing_release_date:.2f}%")

Proportion of missing values in the 'Release_date' column: 23.44%

Those two columns are crucial for our project, and even for big movies like "Pulp Fiction", data is missing (no start date in this case). We therefore managed to match the movies in the CMU dataset with the ones of IMDB, using their [Non-Commercial Datasets](https://developer.imdb.com/non-commercial-datasets/).

The problem is that those two datasets **don't share any unique identifier** to easily match the two together, so we needed to be a bit more creative. What we used is the **name of the movie**, but we couldn't simply compare the strings, since they are not written in the exact same manner. We decided to go with a library called *Rapidfuzz* which allows us to determine the similarty of two strings, which we used for the name matching.

Here is a typical example of why this is needed (both titles are the one in the datasets)

In [ ]:
from rapidfuzz import fuzz

example_title_cmu = "Star Wars Episode IV: A New Hope" # Example title from the CMU database
example_title_imdb = "Star Wars: Episode IV - A New Hope" # Example title from the IMDB database

exact_match = example_title_cmu == example_title_imdb
similarity_match = fuzz.ratio(example_title_cmu, example_title_imdb) > 90

print(f"Using a strict comparison on the name: {exact_match}")
print(f"Using a similarity ratio at 90%: {similarity_match}")

Using a strict comparison on the name: False
Using a similarity ratio at 90%: True

The whole process takes quite some time to run, so we will only load the merged dataframe in this notebook, but the exact computation can be found in *src/utils/imdb_manipulation.py*.

A year column was added and used to complete the Release_date if if was missing. Since IMDB doesn't provide the revenue, we added the number of vote and the rating, so that we can guess the level of popularity of a movie

In [22]:
import src.utils.pipelines as pipelines

all_cmu_and_imdb_data = pipelines.read_CMU_IMDB()
cmu_imdb_merged = all_cmu_and_imdb_data[1]
cmu_imdb_merged.sample(5)

,Wikipedia_movie_ID,Movie_name,Release_date,Revenue,Runtime,Languages,Countries,Genres,weightedAverageRating,totalVotes,is_blockbuster,year
574,7618765.0,the mask,1994-01-01,NaN,0 days 01:23:00,English,Canada,Horror,7.0,435607.0,False,1994
803,15233369.0,slumdog millionaire,2008-08-30,377910544.0,0 days 02:00:00,"Hindi, French, English",United Kingdom,"Thriller, Crime Fiction, Indie, Inspirational ...",8.0,887483.0,True,2008
843,25080984.0,the king's speech,2010-11-26,NaN,0 days 01:59:00,English,"Australia, United Kingdom","Biography, History, Historical fiction, Period...",8.0,715701.0,True,2010
167,24124650.0,the wild bunch,1969-01-01,NaN,NaN,NaN,Israel,Animation,7.9,91913.0,False,1969
833,25447258.0,frozen,2010-01-24,3151086.0,0 days 01:34:00,English,United States of America,"Thriller, Drama, Horror, Indie, Psychological ...",7.4,677430.0,False,2010

# Names datasets

In order to answer our research questions, we needed to find some birth registries from different countries. Those were freely available and we found datasets for the following countries:

- France
- USA
- United Kingdom
- Norway

Since they all came from different places and didn't follow the same structure, we had to decide what kind of data was necessary for our project and what structure would be the most practical to work with. We ended-up with the following collumns in our dataframes:

1. **Year** : An integer value giving the year of the count 
2. **Name** :  A string representing the name that was counted
3. **Sex** : There are two possible characters, 'F' (female) and 'M' (male)
4. **Count** : An integer value giving the count of the name during this year

## Data homogenization

The cleaning task was implement in the *clean_raw_data()* method of our different NamesData classes implementation (by country) and validated using the *check_clean_data()* method, available and shared by all the name datasets (python inheritance).

### Column structure
This task was not too difficult since it was mostly reordering, renaming the ones needed and dropping the ones that were not useful for our project. We also made sure that the same type was used on the collumns of the different datasets. 

### Year 
All of our dataset had the same year format, but some had missing values in this field, which made those row useless and they were therefore discarded.
This collumn made it hard to find datasets from more countries, since a lot of them started to count only in the early 2000's, which doesn't give us enough data to detect real changes in the distribution. (The movie data base ends in 2012)

### Name
This was the hardest column to sanitize and clean since a lot of variation of a same name are possible. We ended by defining a regex expression do define what we would accept as a valid name : ^[A-Z-\s\']+$

This allows us to limit ourselves to names composed only of capitalized letters, spaces, '-' for composed names and ''' for the some regional variations. This rule is really strict and would have made us lose a considerable proportion of our dataset. This is where the data cleaning process came to help homogenize our data and it mainly consisted of the following operations:

- Converting all the name to uppercase
- Removing all accents on letter, for example é becomes e.

Some names have different spellings, for example you can write JEREMY and JEREMIE, but we decided to count this as two separate entries since grouping "similar" is out of the scope of this project and is not an uniformised concept.

### Sex
The french dataset had some integer values that we converted to the expected format. This field is useful for our research questions, but complicated the dataset research, since a lot of countries did not include this information in their registries.

Another issue we encoutered was that some names are given to both men and women. We decided to only keep the data of the sex containg the largest amount of data.

### Validation

The python class representing our datasets contains a method *check_clean_data()* that checks multiple conditions to be sure that the data is uniform. 

- Checks the collumns' name
- Checks if some missing values are present
- Checks the data type of each collumn
- Checks for duplicated rows (same name, same sex and same name)
- Checks that the strings respects the defined regex expressions
- Checks that the counts and years are coherent numbers 

## Demo

Here, we will import and clean the data base to demonstrate the process.

In [23]:
import src.data.names_data as NamesData
ukNames = NamesData.UKNamesData("UK", "ukbabynames.csv")

# The raw data directly from the file
ukNames.raw_df.head()

UK : loaded 565817 rows !

     year sex     name       n  rank           nation
0  1996.0   F   SOPHIE  7087.0   1.0  England & Wales
1  1996.0   F    CHLOE  6824.0   2.0  England & Wales
2  1996.0   F  JESSICA  6711.0   3.0  England & Wales
3  1996.0   F    EMILY  6415.0   4.0  England & Wales
4  1996.0   F   LAUREN  6299.0   5.0  England & Wales

In [24]:
# We can call the cleaning method, which will correct the columns' names and ordering, and clean the content
ukNames.clean_raw_data()
ukNames().head() #  This is the cleaned data

UK : Data is clean and conforms to the expected structure !

   Year    Name Sex  Count
0  1974   AALIA   F      1
1  1974   AAMIR   M      1
2  1974   AARON   M     17
3  1974  ABADAH   F      1
4  1974   ABBEY   F      1

In [ ]:
frenchNames = NamesData.FranceNamesData("France", "france.csv", "https://www.insee.fr/fr/statistiques/8205621?sommaire=8205628#dictionnaire", ";")
frenchNames.raw_df.head()

France : loaded 3884324 rows !

   sexe  preusuel annais dpt  nombre
0     1         A   XXXX  XX      27
1     1     AADAM   XXXX  XX      38
2     1     AADEL   XXXX  XX      56
3     1  AADHIRAN   2023  93       5
4     1  AADHIRAN   XXXX  XX      15

In [26]:
frenchNames.clean_raw_data()
frenchNames().head()

France : Data is clean and conforms to the expected structure !

   Year              Name Sex  Count
0  1900              ABEL   M    382
1  1900        MARIE-ANNE   F     42
2  1900  MARIE-ANTOINETTE   F     61
3  1900     MARIE-EUGENIE   F      3
4  1900   MARIE-FRANCOISE   F     20

In [27]:
USNames = NamesData.USNamesData("US", "babyNamesUSYOB-full.csv")
USNames.raw_df.head()

US : loaded 1858689 rows !

   YearOfBirth       Name Sex  Number
0         1880       Mary   F    7065
1         1880       Anna   F    2604
2         1880       Emma   F    2003
3         1880  Elizabeth   F    1939
4         1880     Minnie   F    1746

In [28]:
USNames.clean_raw_data()
USNames().head()

US : Data is clean and conforms to the expected structure !

   Year       Name Sex  Count
0  1880       MARY   F   7065
1  1880       ANNA   F   2604
2  1880       EMMA   F   2003
3  1880  ELIZABETH   F   1939
4  1880     MINNIE   F   1746

In [29]:
norvegianNames = NamesData.NovergianNamesData("Norway", "norway/norway_merged.csv")
norvegianNames.raw_df.head()

Norway : loaded 277632 rows !

  first name  year Born persons Sex
0       Aage  1880           ..   M
1       Aage  1881           ..   M
2       Aage  1882           ..   M
3       Aage  1883           ..   M
4       Aage  1884           ..   M

In [ ]:
norvegianNames.clean_raw_data()
norvegianNames().head()

Norway : Data is clean and conforms to the expected structure !

   Year   Name Sex  Count
0  1945   AAGE   M     74
1  1945  AAGOT   F     11
2  1945   AASE   F    128
3  1945  AASTA   F      8
4  1945  ABDUL   M     12

### Merging the datasets
If we want to answer a question with no regards to the provenance of the names, we can use our function to group all the datasets together

In [34]:
import src.utils.names_utils as nu

global_names = nu.merge_names_data([ukNames, frenchNames, USNames, norvegianNames])

# Keep only the name with the most data per sex
global_names.sex_handling()

global_names().head()

UK : Data is clean and conforms to the expected structure !
France : Data is clean and conforms to the expected structure !
US : Data is clean and conforms to the expected structure !
Norway : Data is clean and conforms to the expected structure !
UK & France & US & Norway : Data is clean and conforms to the expected structure !

   Year    Name Sex  Count
0  1880   AARON   M    102
1  1880      AB   M      5
2  1880   ABBIE   F     71
3  1880  ABBOTT   M      5
4  1880    ABBY   F      6

# How did we use this data?

Now that we have presented the data used in this project, we will go through the pipelines that were used and what we get from them.

All the pipelines are located in the file */src/utils/pipelines.py*

## Preparing the data

In order to to get all the data that we need ready to go, we have a function TODO